package main

// //算数运算符
// func main() {
// 	// 这里的计算会去掉小数部分直接保留整数部分
// 	fmt.Println(10 / 4)

// 	// 如果我们需要保留小数那么就需要有浮点数参与运算
// 	fmt.Println(10.0 / 4)

// 	// % 的运用
// 	// %的运算符的最后得出的结果和这个运算符左边的数据的符号一样的
// 	fmt.Println(10 % 3)
// 	fmt.Println(-10 % -3)
// 	fmt.Println(-10 % 3)
// 	fmt.Println(10 % -3)

// 	// 然后对于++ 和 -- 这两个运算符的话，只能当作一个独立的语言来使用
// 	// 不支持b := a++ 或 b := a-- 之类的操作

// 	// 就算是下面这样也是不行的，只能当作单独的语句来使用
// 	// if i++ > 0 {
// 	// 	fmt.Println("OK")
// 	// }

// 	// 然后在GO语言里面只有++和--写在变量的后面，不能写在变量的前面
// 	// 只允许a++，a--
// 	// 不允许++a，--a
// 	// 这样的话可以让GO语言更加的简洁，不容易混淆
// }

// 关系运算符
// func main() {
// 	// 关系运算符的返回值都是bool类型的，要么是true，要么是false
// 	// 这一类的运算符通常都是在if结构和循环结构中使用的
// 	// 关系运算符组成的表达式叫做关系运算式
// 	var a int = 10
// 	var b int = 20
// 	fmt.Println(a == b)
// 	fmt.Println(a != b)
// 	fmt.Println(a < b)
// 	fmt.Println(a > b)
// 	fmt.Println(a <= b)
// 	fmt.Println(a >= b)

// }

// 逻辑运算符
// func test() bool {
// 	fmt.Println("test")
// 	return true
// }

// func main() {
// 	// 逻辑运算符的返回值也是一个bool类型的返回值
// 	// && || ！
// 	// 同样遵循逻辑短路情况
// 	var i int = 10

// 	if i < 9 && test() {
// 		fmt.Println("hello")
// 	}

// 	if i > 9 || test() {
// 		fmt.Println("Hi")
// 	}
// }

// 赋值运算符
// func main() {
// 	// 部分的赋值运算符涉及二进制，如<<=, >>=之类的
// 	// 然后就是基本的赋值操作
// 	// 赋值运算符的执行的顺序是从右到左的
// 	// 赋值运算符的左边只能是变量，但是右边可以是变量，表达式，常量

// 	a := 9
// 	b := 2
// 	fmt.Printf("交换前的情况是：a = %v, b = %v\n", a, b)

// 	t := a
// 	a = b
// 	b = t
// 	fmt.Printf("交换后的情况是：a = %v, b = %v\n", a, b)

// 	// 一个技巧：
// 	// 现在有两个变量，现在需要在不使用中间变量的情况下，成功的交换两个变量
// 	// 1. 加减法
// 	a = a + b
// 	b = a - b
// 	a = a - b

// 	// 2. 异或法
// 	a ^= b
// 	b ^= a
// 	a ^= b

// 	// 3. 多重赋值
// 	a, b = b, a
// 	// 在进行多重赋值的时候，首先会取到赋值运算符右边的数据，然后再将数据赋值给左边的变量
// }

// 位运算符
func main() {
	// 和C语言的一样
	// & | ^=
}
