package main

// //算数运算符
// func main() {
// 	// 这里的计算会去掉小数部分直接保留整数部分
// 	fmt.Println(10 / 4)

// 	// 如果我们需要保留小数那么就需要有浮点数参与运算
// 	fmt.Println(10.0 / 4)

// 	// % 的运用
// 	// %的运算符的最后得出的结果和这个运算符左边的数据的符号一样的
// 	fmt.Println(10 % 3)
// 	fmt.Println(-10 % -3)
// 	fmt.Println(-10 % 3)
// 	fmt.Println(10 % -3)

// 	// 然后对于++ 和 -- 这两个运算符的话，只能当作一个独立的语言来使用
// 	// 不支持b := a++ 或 b := a-- 之类的操作

// 	// 就算是下面这样也是不行的，只能当作单独的语句来使用
// 	// if i++ > 0 {
// 	// 	fmt.Println("OK")
// 	// }

// 	// 然后在GO语言里面只有++和--写在变量的后面，不能写在变量的前面
// 	// 只允许a++，a--
// 	// 不允许++a，--a
// 	// 这样的话可以让GO语言更加的简洁，不容易混淆
// }

// 关系运算符
// func main() {
// 	// 关系运算符的返回值都是bool类型的，要么是true，要么是false
// 	// 这一类的运算符通常都是在if结构和循环结构中使用的
// 	// 关系运算符组成的表达式叫做关系运算式
// 	var a int = 10
// 	var b int = 20
// 	fmt.Println(a == b)
// 	fmt.Println(a != b)
// 	fmt.Println(a < b)
// 	fmt.Println(a > b)
// 	fmt.Println(a <= b)
// 	fmt.Println(a >= b)

// }

// 逻辑运算符
func main() {
	// 逻辑运算符的返回值也是一个bool类型的返回值
	// && || ！
	// 同样遵循逻辑短路情况

}
